espressif/esp-idf/components/soc/esp32c5/include/soc/host_reg.h
/** SLCHOST_SLC1HOST_INT_ST_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_INT_ST_REG (DR_REG_SLCHOST_BASE + 0x5c)
/** SLCHOST_SLC1_TOHOST_BIT0_INT_ST : RO; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT0_INT_ST    (BIT(0))
#define SLCHOST_SLC1_TOHOST_BIT0_INT_ST_M  (SLCHOST_SLC1_TOHOST_BIT0_INT_ST_V << SLCHOST_SLC1_TOHOST_BIT0_INT_ST_S)
#define SLCHOST_SLC1_TOHOST_BIT0_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT0_INT_ST_S  0
/** SLCHOST_SLC1_TOHOST_BIT1_INT_ST : RO; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT1_INT_ST    (BIT(1))
#define SLCHOST_SLC1_TOHOST_BIT1_INT_ST_M  (SLCHOST_SLC1_TOHOST_BIT1_INT_ST_V << SLCHOST_SLC1_TOHOST_BIT1_INT_ST_S)
#define SLCHOST_SLC1_TOHOST_BIT1_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT1_INT_ST_S  1
/** SLCHOST_SLC1_TOHOST_BIT2_INT_ST : RO; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT2_INT_ST    (BIT(2))
#define SLCHOST_SLC1_TOHOST_BIT2_INT_ST_M  (SLCHOST_SLC1_TOHOST_BIT2_INT_ST_V << SLCHOST_SLC1_TOHOST_BIT2_INT_ST_S)
#define SLCHOST_SLC1_TOHOST_BIT2_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT2_INT_ST_S  2
/** SLCHOST_SLC1_TOHOST_BIT3_INT_ST : RO; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT3_INT_ST    (BIT(3))
#define SLCHOST_SLC1_TOHOST_BIT3_INT_ST_M  (SLCHOST_SLC1_TOHOST_BIT3_INT_ST_V << SLCHOST_SLC1_TOHOST_BIT3_INT_ST_S)
#define SLCHOST_SLC1_TOHOST_BIT3_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT3_INT_ST_S  3
/** SLCHOST_SLC1_TOHOST_BIT4_INT_ST : RO; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT4_INT_ST    (BIT(4))
#define SLCHOST_SLC1_TOHOST_BIT4_INT_ST_M  (SLCHOST_SLC1_TOHOST_BIT4_INT_ST_V << SLCHOST_SLC1_TOHOST_BIT4_INT_ST_S)
#define SLCHOST_SLC1_TOHOST_BIT4_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT4_INT_ST_S  4
/** SLCHOST_SLC1_TOHOST_BIT5_INT_ST : RO; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT5_INT_ST    (BIT(5))
#define SLCHOST_SLC1_TOHOST_BIT5_INT_ST_M  (SLCHOST_SLC1_TOHOST_BIT5_INT_ST_V << SLCHOST_SLC1_TOHOST_BIT5_INT_ST_S)
#define SLCHOST_SLC1_TOHOST_BIT5_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT5_INT_ST_S  5
/** SLCHOST_SLC1_TOHOST_BIT6_INT_ST : RO; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT6_INT_ST    (BIT(6))
#define SLCHOST_SLC1_TOHOST_BIT6_INT_ST_M  (SLCHOST_SLC1_TOHOST_BIT6_INT_ST_V << SLCHOST_SLC1_TOHOST_BIT6_INT_ST_S)
#define SLCHOST_SLC1_TOHOST_BIT6_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT6_INT_ST_S  6
/** SLCHOST_SLC1_TOHOST_BIT7_INT_ST : RO; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT7_INT_ST    (BIT(7))
#define SLCHOST_SLC1_TOHOST_BIT7_INT_ST_M  (SLCHOST_SLC1_TOHOST_BIT7_INT_ST_V << SLCHOST_SLC1_TOHOST_BIT7_INT_ST_S)
#define SLCHOST_SLC1_TOHOST_BIT7_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT7_INT_ST_S  7
/** SLCHOST_SLC1_TOKEN0_1TO0_INT_ST : RO; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN0_1TO0_INT_ST    (BIT(8))
#define SLCHOST_SLC1_TOKEN0_1TO0_INT_ST_M  (SLCHOST_SLC1_TOKEN0_1TO0_INT_ST_V << SLCHOST_SLC1_TOKEN0_1TO0_INT_ST_S)
#define SLCHOST_SLC1_TOKEN0_1TO0_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TOKEN0_1TO0_INT_ST_S  8
/** SLCHOST_SLC1_TOKEN1_1TO0_INT_ST : RO; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN1_1TO0_INT_ST    (BIT(9))
#define SLCHOST_SLC1_TOKEN1_1TO0_INT_ST_M  (SLCHOST_SLC1_TOKEN1_1TO0_INT_ST_V << SLCHOST_SLC1_TOKEN1_1TO0_INT_ST_S)
#define SLCHOST_SLC1_TOKEN1_1TO0_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TOKEN1_1TO0_INT_ST_S  9
/** SLCHOST_SLC1_TOKEN0_0TO1_INT_ST : RO; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN0_0TO1_INT_ST    (BIT(10))
#define SLCHOST_SLC1_TOKEN0_0TO1_INT_ST_M  (SLCHOST_SLC1_TOKEN0_0TO1_INT_ST_V << SLCHOST_SLC1_TOKEN0_0TO1_INT_ST_S)
#define SLCHOST_SLC1_TOKEN0_0TO1_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TOKEN0_0TO1_INT_ST_S  10
/** SLCHOST_SLC1_TOKEN1_0TO1_INT_ST : RO; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN1_0TO1_INT_ST    (BIT(11))
#define SLCHOST_SLC1_TOKEN1_0TO1_INT_ST_M  (SLCHOST_SLC1_TOKEN1_0TO1_INT_ST_V << SLCHOST_SLC1_TOKEN1_0TO1_INT_ST_S)
#define SLCHOST_SLC1_TOKEN1_0TO1_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TOKEN1_0TO1_INT_ST_S  11
/** SLCHOST_SLC1HOST_RX_SOF_INT_ST : RO; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_RX_SOF_INT_ST    (BIT(12))
#define SLCHOST_SLC1HOST_RX_SOF_INT_ST_M  (SLCHOST_SLC1HOST_RX_SOF_INT_ST_V << SLCHOST_SLC1HOST_RX_SOF_INT_ST_S)
#define SLCHOST_SLC1HOST_RX_SOF_INT_ST_V  0x00000001U
#define SLCHOST_SLC1HOST_RX_SOF_INT_ST_S  12
/** SLCHOST_SLC1HOST_RX_EOF_INT_ST : RO; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_RX_EOF_INT_ST    (BIT(13))
#define SLCHOST_SLC1HOST_RX_EOF_INT_ST_M  (SLCHOST_SLC1HOST_RX_EOF_INT_ST_V << SLCHOST_SLC1HOST_RX_EOF_INT_ST_S)
#define SLCHOST_SLC1HOST_RX_EOF_INT_ST_V  0x00000001U
#define SLCHOST_SLC1HOST_RX_EOF_INT_ST_S  13
/** SLCHOST_SLC1HOST_RX_START_INT_ST : RO; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_RX_START_INT_ST    (BIT(14))
#define SLCHOST_SLC1HOST_RX_START_INT_ST_M  (SLCHOST_SLC1HOST_RX_START_INT_ST_V << SLCHOST_SLC1HOST_RX_START_INT_ST_S)
#define SLCHOST_SLC1HOST_RX_START_INT_ST_V  0x00000001U
#define SLCHOST_SLC1HOST_RX_START_INT_ST_S  14
/** SLCHOST_SLC1HOST_TX_START_INT_ST : RO; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_TX_START_INT_ST    (BIT(15))
#define SLCHOST_SLC1HOST_TX_START_INT_ST_M  (SLCHOST_SLC1HOST_TX_START_INT_ST_V << SLCHOST_SLC1HOST_TX_START_INT_ST_S)
#define SLCHOST_SLC1HOST_TX_START_INT_ST_V  0x00000001U
#define SLCHOST_SLC1HOST_TX_START_INT_ST_S  15
/** SLCHOST_SLC1_RX_UDF_INT_ST : RO; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_RX_UDF_INT_ST    (BIT(16))
#define SLCHOST_SLC1_RX_UDF_INT_ST_M  (SLCHOST_SLC1_RX_UDF_INT_ST_V << SLCHOST_SLC1_RX_UDF_INT_ST_S)
#define SLCHOST_SLC1_RX_UDF_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_RX_UDF_INT_ST_S  16
/** SLCHOST_SLC1_TX_OVF_INT_ST : RO; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TX_OVF_INT_ST    (BIT(17))
#define SLCHOST_SLC1_TX_OVF_INT_ST_M  (SLCHOST_SLC1_TX_OVF_INT_ST_V << SLCHOST_SLC1_TX_OVF_INT_ST_S)
#define SLCHOST_SLC1_TX_OVF_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_TX_OVF_INT_ST_S  17
/** SLCHOST_SLC1_RX_PF_VALID_INT_ST : RO; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_RX_PF_VALID_INT_ST    (BIT(18))
#define SLCHOST_SLC1_RX_PF_VALID_INT_ST_M  (SLCHOST_SLC1_RX_PF_VALID_INT_ST_V << SLCHOST_SLC1_RX_PF_VALID_INT_ST_S)
#define SLCHOST_SLC1_RX_PF_VALID_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_RX_PF_VALID_INT_ST_S  18
/** SLCHOST_SLC1_EXT_BIT0_INT_ST : RO; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_EXT_BIT0_INT_ST    (BIT(19))
#define SLCHOST_SLC1_EXT_BIT0_INT_ST_M  (SLCHOST_SLC1_EXT_BIT0_INT_ST_V << SLCHOST_SLC1_EXT_BIT0_INT_ST_S)
#define SLCHOST_SLC1_EXT_BIT0_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_EXT_BIT0_INT_ST_S  19
/** SLCHOST_SLC1_EXT_BIT1_INT_ST : RO; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_EXT_BIT1_INT_ST    (BIT(20))
#define SLCHOST_SLC1_EXT_BIT1_INT_ST_M  (SLCHOST_SLC1_EXT_BIT1_INT_ST_V << SLCHOST_SLC1_EXT_BIT1_INT_ST_S)
#define SLCHOST_SLC1_EXT_BIT1_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_EXT_BIT1_INT_ST_S  20
/** SLCHOST_SLC1_EXT_BIT2_INT_ST : RO; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_EXT_BIT2_INT_ST    (BIT(21))
#define SLCHOST_SLC1_EXT_BIT2_INT_ST_M  (SLCHOST_SLC1_EXT_BIT2_INT_ST_V << SLCHOST_SLC1_EXT_BIT2_INT_ST_S)
#define SLCHOST_SLC1_EXT_BIT2_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_EXT_BIT2_INT_ST_S  21
/** SLCHOST_SLC1_EXT_BIT3_INT_ST : RO; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_EXT_BIT3_INT_ST    (BIT(22))
#define SLCHOST_SLC1_EXT_BIT3_INT_ST_M  (SLCHOST_SLC1_EXT_BIT3_INT_ST_V << SLCHOST_SLC1_EXT_BIT3_INT_ST_S)
#define SLCHOST_SLC1_EXT_BIT3_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_EXT_BIT3_INT_ST_S  22
/** SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST : RO; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST    (BIT(23))
#define SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_M  (SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_V << SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_S)
#define SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_S  23
/** SLCHOST_SLC1_HOST_RD_RETRY_INT_ST : RO; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_HOST_RD_RETRY_INT_ST    (BIT(24))
#define SLCHOST_SLC1_HOST_RD_RETRY_INT_ST_M  (SLCHOST_SLC1_HOST_RD_RETRY_INT_ST_V << SLCHOST_SLC1_HOST_RD_RETRY_INT_ST_S)
#define SLCHOST_SLC1_HOST_RD_RETRY_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_HOST_RD_RETRY_INT_ST_S  24
/** SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ST : RO; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ST    (BIT(25))
#define SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ST_M  (SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ST_V << SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ST_S)
#define SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ST_V  0x00000001U
#define SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ST_S  25

/** SLCHOST_PKT_LEN_REG register
 *  *******Description***********
 */
#define SLCHOST_PKT_LEN_REG (DR_REG_SLCHOST_BASE + 0x60)
/** SLCHOST_HOSTSLCHOST_SLC0_LEN : RO; bitpos: [19:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_HOSTSLCHOST_SLC0_LEN    0x000FFFFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN_M  (SLCHOST_HOSTSLCHOST_SLC0_LEN_V << SLCHOST_HOSTSLCHOST_SLC0_LEN_S)
#define SLCHOST_HOSTSLCHOST_SLC0_LEN_V  0x000FFFFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN_S  0
/** SLCHOST_HOSTSLCHOST_SLC0_LEN_CHECK : RO; bitpos: [31:20]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_HOSTSLCHOST_SLC0_LEN_CHECK    0x00000FFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN_CHECK_M  (SLCHOST_HOSTSLCHOST_SLC0_LEN_CHECK_V << SLCHOST_HOSTSLCHOST_SLC0_LEN_CHECK_S)
#define SLCHOST_HOSTSLCHOST_SLC0_LEN_CHECK_V  0x00000FFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN_CHECK_S  20

/** SLCHOST_STATE_W0_REG register
 *  *******Description***********
 */
#define SLCHOST_STATE_W0_REG (DR_REG_SLCHOST_BASE + 0x64)
/** SLCHOST_SLCHOST_STATE0 : RO; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_STATE0    0x000000FFU
#define SLCHOST_SLCHOST_STATE0_M  (SLCHOST_SLCHOST_STATE0_V << SLCHOST_SLCHOST_STATE0_S)
#define SLCHOST_SLCHOST_STATE0_V  0x000000FFU
#define SLCHOST_SLCHOST_STATE0_S  0
/** SLCHOST_SLCHOST_STATE1 : RO; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_STATE1    0x000000FFU
#define SLCHOST_SLCHOST_STATE1_M  (SLCHOST_SLCHOST_STATE1_V << SLCHOST_SLCHOST_STATE1_S)
#define SLCHOST_SLCHOST_STATE1_V  0x000000FFU
#define SLCHOST_SLCHOST_STATE1_S  8
/** SLCHOST_SLCHOST_STATE2 : RO; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_STATE2    0x000000FFU
#define SLCHOST_SLCHOST_STATE2_M  (SLCHOST_SLCHOST_STATE2_V << SLCHOST_SLCHOST_STATE2_S)
#define SLCHOST_SLCHOST_STATE2_V  0x000000FFU
#define SLCHOST_SLCHOST_STATE2_S  16
/** SLCHOST_SLCHOST_STATE3 : RO; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_STATE3    0x000000FFU
#define SLCHOST_SLCHOST_STATE3_M  (SLCHOST_SLCHOST_STATE3_V << SLCHOST_SLCHOST_STATE3_S)
#define SLCHOST_SLCHOST_STATE3_V  0x000000FFU
#define SLCHOST_SLCHOST_STATE3_S  24

/** SLCHOST_STATE_W1_REG register
 *  *******Description***********
 */
#define SLCHOST_STATE_W1_REG (DR_REG_SLCHOST_BASE + 0x68)
/** SLCHOST_SLCHOST_STATE4 : RO; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_STATE4    0x000000FFU
#define SLCHOST_SLCHOST_STATE4_M  (SLCHOST_SLCHOST_STATE4_V << SLCHOST_SLCHOST_STATE4_S)
#define SLCHOST_SLCHOST_STATE4_V  0x000000FFU
#define SLCHOST_SLCHOST_STATE4_S  0
/** SLCHOST_SLCHOST_STATE5 : RO; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_STATE5    0x000000FFU
#define SLCHOST_SLCHOST_STATE5_M  (SLCHOST_SLCHOST_STATE5_V << SLCHOST_SLCHOST_STATE5_S)
#define SLCHOST_SLCHOST_STATE5_V  0x000000FFU
#define SLCHOST_SLCHOST_STATE5_S  8
/** SLCHOST_SLCHOST_STATE6 : RO; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_STATE6    0x000000FFU
#define SLCHOST_SLCHOST_STATE6_M  (SLCHOST_SLCHOST_STATE6_V << SLCHOST_SLCHOST_STATE6_S)
#define SLCHOST_SLCHOST_STATE6_V  0x000000FFU
#define SLCHOST_SLCHOST_STATE6_S  16
/** SLCHOST_SLCHOST_STATE7 : RO; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_STATE7    0x000000FFU
#define SLCHOST_SLCHOST_STATE7_M  (SLCHOST_SLCHOST_STATE7_V << SLCHOST_SLCHOST_STATE7_S)
#define SLCHOST_SLCHOST_STATE7_V  0x000000FFU
#define SLCHOST_SLCHOST_STATE7_S  24

/** SLCHOST_CONF_W0_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W0_REG (DR_REG_SLCHOST_BASE + 0x6c)
/** SLCHOST_SLCHOST_CONF0 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF0    0x000000FFU
#define SLCHOST_SLCHOST_CONF0_M  (SLCHOST_SLCHOST_CONF0_V << SLCHOST_SLCHOST_CONF0_S)
#define SLCHOST_SLCHOST_CONF0_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF0_S  0
/** SLCHOST_SLCHOST_CONF1 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF1    0x000000FFU
#define SLCHOST_SLCHOST_CONF1_M  (SLCHOST_SLCHOST_CONF1_V << SLCHOST_SLCHOST_CONF1_S)
#define SLCHOST_SLCHOST_CONF1_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF1_S  8
/** SLCHOST_SLCHOST_CONF2 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF2    0x000000FFU
#define SLCHOST_SLCHOST_CONF2_M  (SLCHOST_SLCHOST_CONF2_V << SLCHOST_SLCHOST_CONF2_S)
#define SLCHOST_SLCHOST_CONF2_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF2_S  16
/** SLCHOST_SLCHOST_CONF3 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF3    0x000000FFU
#define SLCHOST_SLCHOST_CONF3_M  (SLCHOST_SLCHOST_CONF3_V << SLCHOST_SLCHOST_CONF3_S)
#define SLCHOST_SLCHOST_CONF3_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF3_S  24

/** SLCHOST_CONF_W1_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W1_REG (DR_REG_SLCHOST_BASE + 0x70)
/** SLCHOST_SLCHOST_CONF4 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF4    0x000000FFU
#define SLCHOST_SLCHOST_CONF4_M  (SLCHOST_SLCHOST_CONF4_V << SLCHOST_SLCHOST_CONF4_S)
#define SLCHOST_SLCHOST_CONF4_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF4_S  0
/** SLCHOST_SLCHOST_CONF5 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF5    0x000000FFU
#define SLCHOST_SLCHOST_CONF5_M  (SLCHOST_SLCHOST_CONF5_V << SLCHOST_SLCHOST_CONF5_S)
#define SLCHOST_SLCHOST_CONF5_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF5_S  8
/** SLCHOST_SLCHOST_CONF6 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF6    0x000000FFU
#define SLCHOST_SLCHOST_CONF6_M  (SLCHOST_SLCHOST_CONF6_V << SLCHOST_SLCHOST_CONF6_S)
#define SLCHOST_SLCHOST_CONF6_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF6_S  16
/** SLCHOST_SLCHOST_CONF7 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF7    0x000000FFU
#define SLCHOST_SLCHOST_CONF7_M  (SLCHOST_SLCHOST_CONF7_V << SLCHOST_SLCHOST_CONF7_S)
#define SLCHOST_SLCHOST_CONF7_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF7_S  24

/** SLCHOST_CONF_W2_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W2_REG (DR_REG_SLCHOST_BASE + 0x74)
/** SLCHOST_SLCHOST_CONF8 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF8    0x000000FFU
#define SLCHOST_SLCHOST_CONF8_M  (SLCHOST_SLCHOST_CONF8_V << SLCHOST_SLCHOST_CONF8_S)
#define SLCHOST_SLCHOST_CONF8_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF8_S  0
/** SLCHOST_SLCHOST_CONF9 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF9    0x000000FFU
#define SLCHOST_SLCHOST_CONF9_M  (SLCHOST_SLCHOST_CONF9_V << SLCHOST_SLCHOST_CONF9_S)
#define SLCHOST_SLCHOST_CONF9_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF9_S  8
/** SLCHOST_SLCHOST_CONF10 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF10    0x000000FFU
#define SLCHOST_SLCHOST_CONF10_M  (SLCHOST_SLCHOST_CONF10_V << SLCHOST_SLCHOST_CONF10_S)
#define SLCHOST_SLCHOST_CONF10_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF10_S  16
/** SLCHOST_SLCHOST_CONF11 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF11    0x000000FFU
#define SLCHOST_SLCHOST_CONF11_M  (SLCHOST_SLCHOST_CONF11_V << SLCHOST_SLCHOST_CONF11_S)
#define SLCHOST_SLCHOST_CONF11_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF11_S  24

