espressif/esp-idf/components/soc/esp32c5/include/soc/host_reg.h
/** SLCHOST_CONF_W13_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W13_REG (DR_REG_SLCHOST_BASE + 0xb0)
/** SLCHOST_SLCHOST_CONF52 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF52    0x000000FFU
#define SLCHOST_SLCHOST_CONF52_M  (SLCHOST_SLCHOST_CONF52_V << SLCHOST_SLCHOST_CONF52_S)
#define SLCHOST_SLCHOST_CONF52_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF52_S  0
/** SLCHOST_SLCHOST_CONF53 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF53    0x000000FFU
#define SLCHOST_SLCHOST_CONF53_M  (SLCHOST_SLCHOST_CONF53_V << SLCHOST_SLCHOST_CONF53_S)
#define SLCHOST_SLCHOST_CONF53_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF53_S  8
/** SLCHOST_SLCHOST_CONF54 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF54    0x000000FFU
#define SLCHOST_SLCHOST_CONF54_M  (SLCHOST_SLCHOST_CONF54_V << SLCHOST_SLCHOST_CONF54_S)
#define SLCHOST_SLCHOST_CONF54_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF54_S  16
/** SLCHOST_SLCHOST_CONF55 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF55    0x000000FFU
#define SLCHOST_SLCHOST_CONF55_M  (SLCHOST_SLCHOST_CONF55_V << SLCHOST_SLCHOST_CONF55_S)
#define SLCHOST_SLCHOST_CONF55_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF55_S  24

/** SLCHOST_CONF_W14_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W14_REG (DR_REG_SLCHOST_BASE + 0xb4)
/** SLCHOST_SLCHOST_CONF56 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF56    0x000000FFU
#define SLCHOST_SLCHOST_CONF56_M  (SLCHOST_SLCHOST_CONF56_V << SLCHOST_SLCHOST_CONF56_S)
#define SLCHOST_SLCHOST_CONF56_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF56_S  0
/** SLCHOST_SLCHOST_CONF57 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF57    0x000000FFU
#define SLCHOST_SLCHOST_CONF57_M  (SLCHOST_SLCHOST_CONF57_V << SLCHOST_SLCHOST_CONF57_S)
#define SLCHOST_SLCHOST_CONF57_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF57_S  8
/** SLCHOST_SLCHOST_CONF58 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF58    0x000000FFU
#define SLCHOST_SLCHOST_CONF58_M  (SLCHOST_SLCHOST_CONF58_V << SLCHOST_SLCHOST_CONF58_S)
#define SLCHOST_SLCHOST_CONF58_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF58_S  16
/** SLCHOST_SLCHOST_CONF59 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF59    0x000000FFU
#define SLCHOST_SLCHOST_CONF59_M  (SLCHOST_SLCHOST_CONF59_V << SLCHOST_SLCHOST_CONF59_S)
#define SLCHOST_SLCHOST_CONF59_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF59_S  24

/** SLCHOST_CONF_W15_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W15_REG (DR_REG_SLCHOST_BASE + 0xb8)
/** SLCHOST_SLCHOST_CONF60 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF60    0x000000FFU
#define SLCHOST_SLCHOST_CONF60_M  (SLCHOST_SLCHOST_CONF60_V << SLCHOST_SLCHOST_CONF60_S)
#define SLCHOST_SLCHOST_CONF60_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF60_S  0
/** SLCHOST_SLCHOST_CONF61 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF61    0x000000FFU
#define SLCHOST_SLCHOST_CONF61_M  (SLCHOST_SLCHOST_CONF61_V << SLCHOST_SLCHOST_CONF61_S)
#define SLCHOST_SLCHOST_CONF61_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF61_S  8
/** SLCHOST_SLCHOST_CONF62 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF62    0x000000FFU
#define SLCHOST_SLCHOST_CONF62_M  (SLCHOST_SLCHOST_CONF62_V << SLCHOST_SLCHOST_CONF62_S)
#define SLCHOST_SLCHOST_CONF62_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF62_S  16
/** SLCHOST_SLCHOST_CONF63 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF63    0x000000FFU
#define SLCHOST_SLCHOST_CONF63_M  (SLCHOST_SLCHOST_CONF63_V << SLCHOST_SLCHOST_CONF63_S)
#define SLCHOST_SLCHOST_CONF63_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF63_S  24

/** SLCHOST_CHECK_SUM0_REG register
 *  *******Description***********
 */
#define SLCHOST_CHECK_SUM0_REG (DR_REG_SLCHOST_BASE + 0xbc)
/** SLCHOST_SLCHOST_CHECK_SUM0 : RO; bitpos: [31:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CHECK_SUM0    0xFFFFFFFFU
#define SLCHOST_SLCHOST_CHECK_SUM0_M  (SLCHOST_SLCHOST_CHECK_SUM0_V << SLCHOST_SLCHOST_CHECK_SUM0_S)
#define SLCHOST_SLCHOST_CHECK_SUM0_V  0xFFFFFFFFU
#define SLCHOST_SLCHOST_CHECK_SUM0_S  0

/** SLCHOST_CHECK_SUM1_REG register
 *  *******Description***********
 */
#define SLCHOST_CHECK_SUM1_REG (DR_REG_SLCHOST_BASE + 0xc0)
/** SLCHOST_SLCHOST_CHECK_SUM1 : RO; bitpos: [31:0]; default: 319;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CHECK_SUM1    0xFFFFFFFFU
#define SLCHOST_SLCHOST_CHECK_SUM1_M  (SLCHOST_SLCHOST_CHECK_SUM1_V << SLCHOST_SLCHOST_CHECK_SUM1_S)
#define SLCHOST_SLCHOST_CHECK_SUM1_V  0xFFFFFFFFU
#define SLCHOST_SLCHOST_CHECK_SUM1_S  0

/** SLCHOST_SLC1HOST_TOKEN_RDATA_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_TOKEN_RDATA_REG (DR_REG_SLCHOST_BASE + 0xc4)
/** SLCHOST_SLC1_TOKEN0 : RO; bitpos: [11:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN0    0x00000FFFU
#define SLCHOST_SLC1_TOKEN0_M  (SLCHOST_SLC1_TOKEN0_V << SLCHOST_SLC1_TOKEN0_S)
#define SLCHOST_SLC1_TOKEN0_V  0x00000FFFU
#define SLCHOST_SLC1_TOKEN0_S  0
/** SLCHOST_SLC1_RX_PF_VALID : RO; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_RX_PF_VALID    (BIT(12))
#define SLCHOST_SLC1_RX_PF_VALID_M  (SLCHOST_SLC1_RX_PF_VALID_V << SLCHOST_SLC1_RX_PF_VALID_S)
#define SLCHOST_SLC1_RX_PF_VALID_V  0x00000001U
#define SLCHOST_SLC1_RX_PF_VALID_S  12
/** SLCHOST_HOSTSLCHOST_SLC1_TOKEN1 : RO; bitpos: [27:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_HOSTSLCHOST_SLC1_TOKEN1    0x00000FFFU
#define SLCHOST_HOSTSLCHOST_SLC1_TOKEN1_M  (SLCHOST_HOSTSLCHOST_SLC1_TOKEN1_V << SLCHOST_HOSTSLCHOST_SLC1_TOKEN1_S)
#define SLCHOST_HOSTSLCHOST_SLC1_TOKEN1_V  0x00000FFFU
#define SLCHOST_HOSTSLCHOST_SLC1_TOKEN1_S  16
/** SLCHOST_SLC1_RX_PF_EOF : RO; bitpos: [31:28]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_RX_PF_EOF    0x0000000FU
#define SLCHOST_SLC1_RX_PF_EOF_M  (SLCHOST_SLC1_RX_PF_EOF_V << SLCHOST_SLC1_RX_PF_EOF_S)
#define SLCHOST_SLC1_RX_PF_EOF_V  0x0000000FU
#define SLCHOST_SLC1_RX_PF_EOF_S  28

/** SLCHOST_SLC0HOST_TOKEN_WDATA_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_TOKEN_WDATA_REG (DR_REG_SLCHOST_BASE + 0xc8)
/** SLCHOST_SLC0HOST_TOKEN0_WD : R/W; bitpos: [11:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_TOKEN0_WD    0x00000FFFU
#define SLCHOST_SLC0HOST_TOKEN0_WD_M  (SLCHOST_SLC0HOST_TOKEN0_WD_V << SLCHOST_SLC0HOST_TOKEN0_WD_S)
#define SLCHOST_SLC0HOST_TOKEN0_WD_V  0x00000FFFU
#define SLCHOST_SLC0HOST_TOKEN0_WD_S  0
/** SLCHOST_SLC0HOST_TOKEN1_WD : R/W; bitpos: [27:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_TOKEN1_WD    0x00000FFFU
#define SLCHOST_SLC0HOST_TOKEN1_WD_M  (SLCHOST_SLC0HOST_TOKEN1_WD_V << SLCHOST_SLC0HOST_TOKEN1_WD_S)
#define SLCHOST_SLC0HOST_TOKEN1_WD_V  0x00000FFFU
#define SLCHOST_SLC0HOST_TOKEN1_WD_S  16

/** SLCHOST_SLC1HOST_TOKEN_WDATA_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_TOKEN_WDATA_REG (DR_REG_SLCHOST_BASE + 0xcc)
/** SLCHOST_SLC1HOST_TOKEN0_WD : R/W; bitpos: [11:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_TOKEN0_WD    0x00000FFFU
#define SLCHOST_SLC1HOST_TOKEN0_WD_M  (SLCHOST_SLC1HOST_TOKEN0_WD_V << SLCHOST_SLC1HOST_TOKEN0_WD_S)
#define SLCHOST_SLC1HOST_TOKEN0_WD_V  0x00000FFFU
#define SLCHOST_SLC1HOST_TOKEN0_WD_S  0
/** SLCHOST_SLC1HOST_TOKEN1_WD : R/W; bitpos: [27:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_TOKEN1_WD    0x00000FFFU
#define SLCHOST_SLC1HOST_TOKEN1_WD_M  (SLCHOST_SLC1HOST_TOKEN1_WD_V << SLCHOST_SLC1HOST_TOKEN1_WD_S)
#define SLCHOST_SLC1HOST_TOKEN1_WD_V  0x00000FFFU
#define SLCHOST_SLC1HOST_TOKEN1_WD_S  16

/** SLCHOST_TOKEN_CON_REG register
 *  *******Description***********
 */
#define SLCHOST_TOKEN_CON_REG (DR_REG_SLCHOST_BASE + 0xd0)
/** SLCHOST_SLC0HOST_TOKEN0_DEC : WT; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_TOKEN0_DEC    (BIT(0))
#define SLCHOST_SLC0HOST_TOKEN0_DEC_M  (SLCHOST_SLC0HOST_TOKEN0_DEC_V << SLCHOST_SLC0HOST_TOKEN0_DEC_S)
#define SLCHOST_SLC0HOST_TOKEN0_DEC_V  0x00000001U
#define SLCHOST_SLC0HOST_TOKEN0_DEC_S  0
/** SLCHOST_SLC0HOST_TOKEN1_DEC : WT; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_TOKEN1_DEC    (BIT(1))
#define SLCHOST_SLC0HOST_TOKEN1_DEC_M  (SLCHOST_SLC0HOST_TOKEN1_DEC_V << SLCHOST_SLC0HOST_TOKEN1_DEC_S)
#define SLCHOST_SLC0HOST_TOKEN1_DEC_V  0x00000001U
#define SLCHOST_SLC0HOST_TOKEN1_DEC_S  1
/** SLCHOST_SLC0HOST_TOKEN0_WR : WT; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_TOKEN0_WR    (BIT(2))
#define SLCHOST_SLC0HOST_TOKEN0_WR_M  (SLCHOST_SLC0HOST_TOKEN0_WR_V << SLCHOST_SLC0HOST_TOKEN0_WR_S)
#define SLCHOST_SLC0HOST_TOKEN0_WR_V  0x00000001U
#define SLCHOST_SLC0HOST_TOKEN0_WR_S  2
/** SLCHOST_SLC0HOST_TOKEN1_WR : WT; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_TOKEN1_WR    (BIT(3))
#define SLCHOST_SLC0HOST_TOKEN1_WR_M  (SLCHOST_SLC0HOST_TOKEN1_WR_V << SLCHOST_SLC0HOST_TOKEN1_WR_S)
#define SLCHOST_SLC0HOST_TOKEN1_WR_V  0x00000001U
#define SLCHOST_SLC0HOST_TOKEN1_WR_S  3
/** SLCHOST_SLC1HOST_TOKEN0_DEC : WT; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_TOKEN0_DEC    (BIT(4))
#define SLCHOST_SLC1HOST_TOKEN0_DEC_M  (SLCHOST_SLC1HOST_TOKEN0_DEC_V << SLCHOST_SLC1HOST_TOKEN0_DEC_S)
#define SLCHOST_SLC1HOST_TOKEN0_DEC_V  0x00000001U
#define SLCHOST_SLC1HOST_TOKEN0_DEC_S  4
/** SLCHOST_SLC1HOST_TOKEN1_DEC : WT; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_TOKEN1_DEC    (BIT(5))
#define SLCHOST_SLC1HOST_TOKEN1_DEC_M  (SLCHOST_SLC1HOST_TOKEN1_DEC_V << SLCHOST_SLC1HOST_TOKEN1_DEC_S)
#define SLCHOST_SLC1HOST_TOKEN1_DEC_V  0x00000001U
#define SLCHOST_SLC1HOST_TOKEN1_DEC_S  5
/** SLCHOST_SLC1HOST_TOKEN0_WR : WT; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_TOKEN0_WR    (BIT(6))
#define SLCHOST_SLC1HOST_TOKEN0_WR_M  (SLCHOST_SLC1HOST_TOKEN0_WR_V << SLCHOST_SLC1HOST_TOKEN0_WR_S)
#define SLCHOST_SLC1HOST_TOKEN0_WR_V  0x00000001U
#define SLCHOST_SLC1HOST_TOKEN0_WR_S  6
/** SLCHOST_SLC1HOST_TOKEN1_WR : WT; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_TOKEN1_WR    (BIT(7))
#define SLCHOST_SLC1HOST_TOKEN1_WR_M  (SLCHOST_SLC1HOST_TOKEN1_WR_V << SLCHOST_SLC1HOST_TOKEN1_WR_S)
#define SLCHOST_SLC1HOST_TOKEN1_WR_V  0x00000001U
#define SLCHOST_SLC1HOST_TOKEN1_WR_S  7
/** SLCHOST_SLC0HOST_LEN_WR : WT; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_LEN_WR    (BIT(8))
#define SLCHOST_SLC0HOST_LEN_WR_M  (SLCHOST_SLC0HOST_LEN_WR_V << SLCHOST_SLC0HOST_LEN_WR_S)
#define SLCHOST_SLC0HOST_LEN_WR_V  0x00000001U
#define SLCHOST_SLC0HOST_LEN_WR_S  8

/** SLCHOST_SLC0HOST_INT_CLR_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_INT_CLR_REG (DR_REG_SLCHOST_BASE + 0xd4)
/** SLCHOST_SLC0_TOHOST_BIT0_INT_CLR : WT; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT0_INT_CLR    (BIT(0))
#define SLCHOST_SLC0_TOHOST_BIT0_INT_CLR_M  (SLCHOST_SLC0_TOHOST_BIT0_INT_CLR_V << SLCHOST_SLC0_TOHOST_BIT0_INT_CLR_S)
#define SLCHOST_SLC0_TOHOST_BIT0_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT0_INT_CLR_S  0
/** SLCHOST_SLC0_TOHOST_BIT1_INT_CLR : WT; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT1_INT_CLR    (BIT(1))
#define SLCHOST_SLC0_TOHOST_BIT1_INT_CLR_M  (SLCHOST_SLC0_TOHOST_BIT1_INT_CLR_V << SLCHOST_SLC0_TOHOST_BIT1_INT_CLR_S)
#define SLCHOST_SLC0_TOHOST_BIT1_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT1_INT_CLR_S  1
/** SLCHOST_SLC0_TOHOST_BIT2_INT_CLR : WT; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT2_INT_CLR    (BIT(2))
#define SLCHOST_SLC0_TOHOST_BIT2_INT_CLR_M  (SLCHOST_SLC0_TOHOST_BIT2_INT_CLR_V << SLCHOST_SLC0_TOHOST_BIT2_INT_CLR_S)
#define SLCHOST_SLC0_TOHOST_BIT2_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT2_INT_CLR_S  2
/** SLCHOST_SLC0_TOHOST_BIT3_INT_CLR : WT; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT3_INT_CLR    (BIT(3))
#define SLCHOST_SLC0_TOHOST_BIT3_INT_CLR_M  (SLCHOST_SLC0_TOHOST_BIT3_INT_CLR_V << SLCHOST_SLC0_TOHOST_BIT3_INT_CLR_S)
#define SLCHOST_SLC0_TOHOST_BIT3_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT3_INT_CLR_S  3
/** SLCHOST_SLC0_TOHOST_BIT4_INT_CLR : WT; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT4_INT_CLR    (BIT(4))
#define SLCHOST_SLC0_TOHOST_BIT4_INT_CLR_M  (SLCHOST_SLC0_TOHOST_BIT4_INT_CLR_V << SLCHOST_SLC0_TOHOST_BIT4_INT_CLR_S)
#define SLCHOST_SLC0_TOHOST_BIT4_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT4_INT_CLR_S  4
/** SLCHOST_SLC0_TOHOST_BIT5_INT_CLR : WT; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT5_INT_CLR    (BIT(5))
#define SLCHOST_SLC0_TOHOST_BIT5_INT_CLR_M  (SLCHOST_SLC0_TOHOST_BIT5_INT_CLR_V << SLCHOST_SLC0_TOHOST_BIT5_INT_CLR_S)
#define SLCHOST_SLC0_TOHOST_BIT5_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT5_INT_CLR_S  5
/** SLCHOST_SLC0_TOHOST_BIT6_INT_CLR : WT; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT6_INT_CLR    (BIT(6))
#define SLCHOST_SLC0_TOHOST_BIT6_INT_CLR_M  (SLCHOST_SLC0_TOHOST_BIT6_INT_CLR_V << SLCHOST_SLC0_TOHOST_BIT6_INT_CLR_S)
#define SLCHOST_SLC0_TOHOST_BIT6_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT6_INT_CLR_S  6
/** SLCHOST_SLC0_TOHOST_BIT7_INT_CLR : WT; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT7_INT_CLR    (BIT(7))
#define SLCHOST_SLC0_TOHOST_BIT7_INT_CLR_M  (SLCHOST_SLC0_TOHOST_BIT7_INT_CLR_V << SLCHOST_SLC0_TOHOST_BIT7_INT_CLR_S)
#define SLCHOST_SLC0_TOHOST_BIT7_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT7_INT_CLR_S  7
/** SLCHOST_SLC0_TOKEN0_1TO0_INT_CLR : WT; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOKEN0_1TO0_INT_CLR    (BIT(8))
#define SLCHOST_SLC0_TOKEN0_1TO0_INT_CLR_M  (SLCHOST_SLC0_TOKEN0_1TO0_INT_CLR_V << SLCHOST_SLC0_TOKEN0_1TO0_INT_CLR_S)
#define SLCHOST_SLC0_TOKEN0_1TO0_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TOKEN0_1TO0_INT_CLR_S  8
/** SLCHOST_SLC0_TOKEN1_1TO0_INT_CLR : WT; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOKEN1_1TO0_INT_CLR    (BIT(9))
#define SLCHOST_SLC0_TOKEN1_1TO0_INT_CLR_M  (SLCHOST_SLC0_TOKEN1_1TO0_INT_CLR_V << SLCHOST_SLC0_TOKEN1_1TO0_INT_CLR_S)
#define SLCHOST_SLC0_TOKEN1_1TO0_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TOKEN1_1TO0_INT_CLR_S  9
/** SLCHOST_SLC0_TOKEN0_0TO1_INT_CLR : WT; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOKEN0_0TO1_INT_CLR    (BIT(10))
#define SLCHOST_SLC0_TOKEN0_0TO1_INT_CLR_M  (SLCHOST_SLC0_TOKEN0_0TO1_INT_CLR_V << SLCHOST_SLC0_TOKEN0_0TO1_INT_CLR_S)
#define SLCHOST_SLC0_TOKEN0_0TO1_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TOKEN0_0TO1_INT_CLR_S  10
/** SLCHOST_SLC0_TOKEN1_0TO1_INT_CLR : WT; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOKEN1_0TO1_INT_CLR    (BIT(11))
#define SLCHOST_SLC0_TOKEN1_0TO1_INT_CLR_M  (SLCHOST_SLC0_TOKEN1_0TO1_INT_CLR_V << SLCHOST_SLC0_TOKEN1_0TO1_INT_CLR_S)
#define SLCHOST_SLC0_TOKEN1_0TO1_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TOKEN1_0TO1_INT_CLR_S  11
/** SLCHOST_SLC0HOST_RX_SOF_INT_CLR : WT; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_RX_SOF_INT_CLR    (BIT(12))
#define SLCHOST_SLC0HOST_RX_SOF_INT_CLR_M  (SLCHOST_SLC0HOST_RX_SOF_INT_CLR_V << SLCHOST_SLC0HOST_RX_SOF_INT_CLR_S)
#define SLCHOST_SLC0HOST_RX_SOF_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0HOST_RX_SOF_INT_CLR_S  12
/** SLCHOST_SLC0HOST_RX_EOF_INT_CLR : WT; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_RX_EOF_INT_CLR    (BIT(13))
#define SLCHOST_SLC0HOST_RX_EOF_INT_CLR_M  (SLCHOST_SLC0HOST_RX_EOF_INT_CLR_V << SLCHOST_SLC0HOST_RX_EOF_INT_CLR_S)
#define SLCHOST_SLC0HOST_RX_EOF_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0HOST_RX_EOF_INT_CLR_S  13
/** SLCHOST_SLC0HOST_RX_START_INT_CLR : WT; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_RX_START_INT_CLR    (BIT(14))
#define SLCHOST_SLC0HOST_RX_START_INT_CLR_M  (SLCHOST_SLC0HOST_RX_START_INT_CLR_V << SLCHOST_SLC0HOST_RX_START_INT_CLR_S)
#define SLCHOST_SLC0HOST_RX_START_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0HOST_RX_START_INT_CLR_S  14
/** SLCHOST_SLC0HOST_TX_START_INT_CLR : WT; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_TX_START_INT_CLR    (BIT(15))
#define SLCHOST_SLC0HOST_TX_START_INT_CLR_M  (SLCHOST_SLC0HOST_TX_START_INT_CLR_V << SLCHOST_SLC0HOST_TX_START_INT_CLR_S)
#define SLCHOST_SLC0HOST_TX_START_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0HOST_TX_START_INT_CLR_S  15
/** SLCHOST_SLC0_RX_UDF_INT_CLR : WT; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_RX_UDF_INT_CLR    (BIT(16))
#define SLCHOST_SLC0_RX_UDF_INT_CLR_M  (SLCHOST_SLC0_RX_UDF_INT_CLR_V << SLCHOST_SLC0_RX_UDF_INT_CLR_S)
#define SLCHOST_SLC0_RX_UDF_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_RX_UDF_INT_CLR_S  16
/** SLCHOST_SLC0_TX_OVF_INT_CLR : WT; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TX_OVF_INT_CLR    (BIT(17))
#define SLCHOST_SLC0_TX_OVF_INT_CLR_M  (SLCHOST_SLC0_TX_OVF_INT_CLR_V << SLCHOST_SLC0_TX_OVF_INT_CLR_S)
#define SLCHOST_SLC0_TX_OVF_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_TX_OVF_INT_CLR_S  17
/** SLCHOST_SLC0_RX_PF_VALID_INT_CLR : WT; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_RX_PF_VALID_INT_CLR    (BIT(18))
#define SLCHOST_SLC0_RX_PF_VALID_INT_CLR_M  (SLCHOST_SLC0_RX_PF_VALID_INT_CLR_V << SLCHOST_SLC0_RX_PF_VALID_INT_CLR_S)
#define SLCHOST_SLC0_RX_PF_VALID_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_RX_PF_VALID_INT_CLR_S  18
/** SLCHOST_SLC0_EXT_BIT0_INT_CLR : WT; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_EXT_BIT0_INT_CLR    (BIT(19))
#define SLCHOST_SLC0_EXT_BIT0_INT_CLR_M  (SLCHOST_SLC0_EXT_BIT0_INT_CLR_V << SLCHOST_SLC0_EXT_BIT0_INT_CLR_S)
#define SLCHOST_SLC0_EXT_BIT0_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_EXT_BIT0_INT_CLR_S  19
/** SLCHOST_SLC0_EXT_BIT1_INT_CLR : WT; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_EXT_BIT1_INT_CLR    (BIT(20))
#define SLCHOST_SLC0_EXT_BIT1_INT_CLR_M  (SLCHOST_SLC0_EXT_BIT1_INT_CLR_V << SLCHOST_SLC0_EXT_BIT1_INT_CLR_S)
#define SLCHOST_SLC0_EXT_BIT1_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_EXT_BIT1_INT_CLR_S  20
/** SLCHOST_SLC0_EXT_BIT2_INT_CLR : WT; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_EXT_BIT2_INT_CLR    (BIT(21))
#define SLCHOST_SLC0_EXT_BIT2_INT_CLR_M  (SLCHOST_SLC0_EXT_BIT2_INT_CLR_V << SLCHOST_SLC0_EXT_BIT2_INT_CLR_S)
#define SLCHOST_SLC0_EXT_BIT2_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_EXT_BIT2_INT_CLR_S  21
/** SLCHOST_SLC0_EXT_BIT3_INT_CLR : WT; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_EXT_BIT3_INT_CLR    (BIT(22))
#define SLCHOST_SLC0_EXT_BIT3_INT_CLR_M  (SLCHOST_SLC0_EXT_BIT3_INT_CLR_V << SLCHOST_SLC0_EXT_BIT3_INT_CLR_S)
#define SLCHOST_SLC0_EXT_BIT3_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_EXT_BIT3_INT_CLR_S  22
/** SLCHOST_SLC0_RX_NEW_PACKET_INT_CLR : WT; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_RX_NEW_PACKET_INT_CLR    (BIT(23))
#define SLCHOST_SLC0_RX_NEW_PACKET_INT_CLR_M  (SLCHOST_SLC0_RX_NEW_PACKET_INT_CLR_V << SLCHOST_SLC0_RX_NEW_PACKET_INT_CLR_S)
#define SLCHOST_SLC0_RX_NEW_PACKET_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_RX_NEW_PACKET_INT_CLR_S  23
/** SLCHOST_SLC0_HOST_RD_RETRY_INT_CLR : WT; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_HOST_RD_RETRY_INT_CLR    (BIT(24))
#define SLCHOST_SLC0_HOST_RD_RETRY_INT_CLR_M  (SLCHOST_SLC0_HOST_RD_RETRY_INT_CLR_V << SLCHOST_SLC0_HOST_RD_RETRY_INT_CLR_S)
#define SLCHOST_SLC0_HOST_RD_RETRY_INT_CLR_V  0x00000001U
#define SLCHOST_SLC0_HOST_RD_RETRY_INT_CLR_S  24
/** SLCHOST_GPIO_SDIO_INT_CLR : WT; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_GPIO_SDIO_INT_CLR    (BIT(25))
#define SLCHOST_GPIO_SDIO_INT_CLR_M  (SLCHOST_GPIO_SDIO_INT_CLR_V << SLCHOST_GPIO_SDIO_INT_CLR_S)
#define SLCHOST_GPIO_SDIO_INT_CLR_V  0x00000001U
#define SLCHOST_GPIO_SDIO_INT_CLR_S  25

