espressif/esp-idf/components/soc/esp32c5/include/soc/host_reg.h
/** SLCHOST_SLC1HOST_INT_CLR_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_INT_CLR_REG (DR_REG_SLCHOST_BASE + 0xd8)
/** SLCHOST_SLC1_TOHOST_BIT0_INT_CLR : WT; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT0_INT_CLR    (BIT(0))
#define SLCHOST_SLC1_TOHOST_BIT0_INT_CLR_M  (SLCHOST_SLC1_TOHOST_BIT0_INT_CLR_V << SLCHOST_SLC1_TOHOST_BIT0_INT_CLR_S)
#define SLCHOST_SLC1_TOHOST_BIT0_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT0_INT_CLR_S  0
/** SLCHOST_SLC1_TOHOST_BIT1_INT_CLR : WT; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT1_INT_CLR    (BIT(1))
#define SLCHOST_SLC1_TOHOST_BIT1_INT_CLR_M  (SLCHOST_SLC1_TOHOST_BIT1_INT_CLR_V << SLCHOST_SLC1_TOHOST_BIT1_INT_CLR_S)
#define SLCHOST_SLC1_TOHOST_BIT1_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT1_INT_CLR_S  1
/** SLCHOST_SLC1_TOHOST_BIT2_INT_CLR : WT; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT2_INT_CLR    (BIT(2))
#define SLCHOST_SLC1_TOHOST_BIT2_INT_CLR_M  (SLCHOST_SLC1_TOHOST_BIT2_INT_CLR_V << SLCHOST_SLC1_TOHOST_BIT2_INT_CLR_S)
#define SLCHOST_SLC1_TOHOST_BIT2_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT2_INT_CLR_S  2
/** SLCHOST_SLC1_TOHOST_BIT3_INT_CLR : WT; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT3_INT_CLR    (BIT(3))
#define SLCHOST_SLC1_TOHOST_BIT3_INT_CLR_M  (SLCHOST_SLC1_TOHOST_BIT3_INT_CLR_V << SLCHOST_SLC1_TOHOST_BIT3_INT_CLR_S)
#define SLCHOST_SLC1_TOHOST_BIT3_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT3_INT_CLR_S  3
/** SLCHOST_SLC1_TOHOST_BIT4_INT_CLR : WT; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT4_INT_CLR    (BIT(4))
#define SLCHOST_SLC1_TOHOST_BIT4_INT_CLR_M  (SLCHOST_SLC1_TOHOST_BIT4_INT_CLR_V << SLCHOST_SLC1_TOHOST_BIT4_INT_CLR_S)
#define SLCHOST_SLC1_TOHOST_BIT4_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT4_INT_CLR_S  4
/** SLCHOST_SLC1_TOHOST_BIT5_INT_CLR : WT; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT5_INT_CLR    (BIT(5))
#define SLCHOST_SLC1_TOHOST_BIT5_INT_CLR_M  (SLCHOST_SLC1_TOHOST_BIT5_INT_CLR_V << SLCHOST_SLC1_TOHOST_BIT5_INT_CLR_S)
#define SLCHOST_SLC1_TOHOST_BIT5_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT5_INT_CLR_S  5
/** SLCHOST_SLC1_TOHOST_BIT6_INT_CLR : WT; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT6_INT_CLR    (BIT(6))
#define SLCHOST_SLC1_TOHOST_BIT6_INT_CLR_M  (SLCHOST_SLC1_TOHOST_BIT6_INT_CLR_V << SLCHOST_SLC1_TOHOST_BIT6_INT_CLR_S)
#define SLCHOST_SLC1_TOHOST_BIT6_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT6_INT_CLR_S  6
/** SLCHOST_SLC1_TOHOST_BIT7_INT_CLR : WT; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT7_INT_CLR    (BIT(7))
#define SLCHOST_SLC1_TOHOST_BIT7_INT_CLR_M  (SLCHOST_SLC1_TOHOST_BIT7_INT_CLR_V << SLCHOST_SLC1_TOHOST_BIT7_INT_CLR_S)
#define SLCHOST_SLC1_TOHOST_BIT7_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT7_INT_CLR_S  7
/** SLCHOST_SLC1_TOKEN0_1TO0_INT_CLR : WT; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN0_1TO0_INT_CLR    (BIT(8))
#define SLCHOST_SLC1_TOKEN0_1TO0_INT_CLR_M  (SLCHOST_SLC1_TOKEN0_1TO0_INT_CLR_V << SLCHOST_SLC1_TOKEN0_1TO0_INT_CLR_S)
#define SLCHOST_SLC1_TOKEN0_1TO0_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TOKEN0_1TO0_INT_CLR_S  8
/** SLCHOST_SLC1_TOKEN1_1TO0_INT_CLR : WT; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN1_1TO0_INT_CLR    (BIT(9))
#define SLCHOST_SLC1_TOKEN1_1TO0_INT_CLR_M  (SLCHOST_SLC1_TOKEN1_1TO0_INT_CLR_V << SLCHOST_SLC1_TOKEN1_1TO0_INT_CLR_S)
#define SLCHOST_SLC1_TOKEN1_1TO0_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TOKEN1_1TO0_INT_CLR_S  9
/** SLCHOST_SLC1_TOKEN0_0TO1_INT_CLR : WT; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN0_0TO1_INT_CLR    (BIT(10))
#define SLCHOST_SLC1_TOKEN0_0TO1_INT_CLR_M  (SLCHOST_SLC1_TOKEN0_0TO1_INT_CLR_V << SLCHOST_SLC1_TOKEN0_0TO1_INT_CLR_S)
#define SLCHOST_SLC1_TOKEN0_0TO1_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TOKEN0_0TO1_INT_CLR_S  10
/** SLCHOST_SLC1_TOKEN1_0TO1_INT_CLR : WT; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN1_0TO1_INT_CLR    (BIT(11))
#define SLCHOST_SLC1_TOKEN1_0TO1_INT_CLR_M  (SLCHOST_SLC1_TOKEN1_0TO1_INT_CLR_V << SLCHOST_SLC1_TOKEN1_0TO1_INT_CLR_S)
#define SLCHOST_SLC1_TOKEN1_0TO1_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TOKEN1_0TO1_INT_CLR_S  11
/** SLCHOST_SLC1HOST_RX_SOF_INT_CLR : WT; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_RX_SOF_INT_CLR    (BIT(12))
#define SLCHOST_SLC1HOST_RX_SOF_INT_CLR_M  (SLCHOST_SLC1HOST_RX_SOF_INT_CLR_V << SLCHOST_SLC1HOST_RX_SOF_INT_CLR_S)
#define SLCHOST_SLC1HOST_RX_SOF_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1HOST_RX_SOF_INT_CLR_S  12
/** SLCHOST_SLC1HOST_RX_EOF_INT_CLR : WT; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_RX_EOF_INT_CLR    (BIT(13))
#define SLCHOST_SLC1HOST_RX_EOF_INT_CLR_M  (SLCHOST_SLC1HOST_RX_EOF_INT_CLR_V << SLCHOST_SLC1HOST_RX_EOF_INT_CLR_S)
#define SLCHOST_SLC1HOST_RX_EOF_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1HOST_RX_EOF_INT_CLR_S  13
/** SLCHOST_SLC1HOST_RX_START_INT_CLR : WT; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_RX_START_INT_CLR    (BIT(14))
#define SLCHOST_SLC1HOST_RX_START_INT_CLR_M  (SLCHOST_SLC1HOST_RX_START_INT_CLR_V << SLCHOST_SLC1HOST_RX_START_INT_CLR_S)
#define SLCHOST_SLC1HOST_RX_START_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1HOST_RX_START_INT_CLR_S  14
/** SLCHOST_SLC1HOST_TX_START_INT_CLR : WT; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_TX_START_INT_CLR    (BIT(15))
#define SLCHOST_SLC1HOST_TX_START_INT_CLR_M  (SLCHOST_SLC1HOST_TX_START_INT_CLR_V << SLCHOST_SLC1HOST_TX_START_INT_CLR_S)
#define SLCHOST_SLC1HOST_TX_START_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1HOST_TX_START_INT_CLR_S  15
/** SLCHOST_SLC1_RX_UDF_INT_CLR : WT; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_RX_UDF_INT_CLR    (BIT(16))
#define SLCHOST_SLC1_RX_UDF_INT_CLR_M  (SLCHOST_SLC1_RX_UDF_INT_CLR_V << SLCHOST_SLC1_RX_UDF_INT_CLR_S)
#define SLCHOST_SLC1_RX_UDF_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_RX_UDF_INT_CLR_S  16
/** SLCHOST_SLC1_TX_OVF_INT_CLR : WT; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TX_OVF_INT_CLR    (BIT(17))
#define SLCHOST_SLC1_TX_OVF_INT_CLR_M  (SLCHOST_SLC1_TX_OVF_INT_CLR_V << SLCHOST_SLC1_TX_OVF_INT_CLR_S)
#define SLCHOST_SLC1_TX_OVF_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_TX_OVF_INT_CLR_S  17
/** SLCHOST_SLC1_RX_PF_VALID_INT_CLR : WT; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_RX_PF_VALID_INT_CLR    (BIT(18))
#define SLCHOST_SLC1_RX_PF_VALID_INT_CLR_M  (SLCHOST_SLC1_RX_PF_VALID_INT_CLR_V << SLCHOST_SLC1_RX_PF_VALID_INT_CLR_S)
#define SLCHOST_SLC1_RX_PF_VALID_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_RX_PF_VALID_INT_CLR_S  18
/** SLCHOST_SLC1_EXT_BIT0_INT_CLR : WT; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_EXT_BIT0_INT_CLR    (BIT(19))
#define SLCHOST_SLC1_EXT_BIT0_INT_CLR_M  (SLCHOST_SLC1_EXT_BIT0_INT_CLR_V << SLCHOST_SLC1_EXT_BIT0_INT_CLR_S)
#define SLCHOST_SLC1_EXT_BIT0_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_EXT_BIT0_INT_CLR_S  19
/** SLCHOST_SLC1_EXT_BIT1_INT_CLR : WT; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_EXT_BIT1_INT_CLR    (BIT(20))
#define SLCHOST_SLC1_EXT_BIT1_INT_CLR_M  (SLCHOST_SLC1_EXT_BIT1_INT_CLR_V << SLCHOST_SLC1_EXT_BIT1_INT_CLR_S)
#define SLCHOST_SLC1_EXT_BIT1_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_EXT_BIT1_INT_CLR_S  20
/** SLCHOST_SLC1_EXT_BIT2_INT_CLR : WT; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_EXT_BIT2_INT_CLR    (BIT(21))
#define SLCHOST_SLC1_EXT_BIT2_INT_CLR_M  (SLCHOST_SLC1_EXT_BIT2_INT_CLR_V << SLCHOST_SLC1_EXT_BIT2_INT_CLR_S)
#define SLCHOST_SLC1_EXT_BIT2_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_EXT_BIT2_INT_CLR_S  21
/** SLCHOST_SLC1_EXT_BIT3_INT_CLR : WT; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_EXT_BIT3_INT_CLR    (BIT(22))
#define SLCHOST_SLC1_EXT_BIT3_INT_CLR_M  (SLCHOST_SLC1_EXT_BIT3_INT_CLR_V << SLCHOST_SLC1_EXT_BIT3_INT_CLR_S)
#define SLCHOST_SLC1_EXT_BIT3_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_EXT_BIT3_INT_CLR_S  22
/** SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR : WT; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR    (BIT(23))
#define SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR_M  (SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR_V << SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR_S)
#define SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_CLR_S  23
/** SLCHOST_SLC1_HOST_RD_RETRY_INT_CLR : WT; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_HOST_RD_RETRY_INT_CLR    (BIT(24))
#define SLCHOST_SLC1_HOST_RD_RETRY_INT_CLR_M  (SLCHOST_SLC1_HOST_RD_RETRY_INT_CLR_V << SLCHOST_SLC1_HOST_RD_RETRY_INT_CLR_S)
#define SLCHOST_SLC1_HOST_RD_RETRY_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_HOST_RD_RETRY_INT_CLR_S  24
/** SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_CLR : WT; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_CLR    (BIT(25))
#define SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_CLR_M  (SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_CLR_V << SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_CLR_S)
#define SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_CLR_V  0x00000001U
#define SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_CLR_S  25

/** SLCHOST_SLC0HOST_FUNC1_INT_ENA_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_FUNC1_INT_ENA_REG (DR_REG_SLCHOST_BASE + 0xdc)
/** SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA    (BIT(0))
#define SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA_M  (SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA_V << SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA_S  0
/** SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA    (BIT(1))
#define SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA_M  (SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA_V << SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA_S  1
/** SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA    (BIT(2))
#define SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA_M  (SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA_V << SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA_S  2
/** SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA    (BIT(3))
#define SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA_M  (SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA_V << SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA_S  3
/** SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA    (BIT(4))
#define SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA_M  (SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA_V << SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA_S  4
/** SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA    (BIT(5))
#define SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA_M  (SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA_V << SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA_S  5
/** SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA    (BIT(6))
#define SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA_M  (SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA_V << SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA_S  6
/** SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA    (BIT(7))
#define SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA_M  (SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA_V << SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA_S  7
/** SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA    (BIT(8))
#define SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA_M  (SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA_V << SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA_S  8
/** SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA    (BIT(9))
#define SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA_M  (SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA_V << SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA_S  9
/** SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA    (BIT(10))
#define SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA_M  (SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA_V << SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA_S  10
/** SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA    (BIT(11))
#define SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA_M  (SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA_V << SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA_S  11
/** SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA    (BIT(12))
#define SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA_M  (SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA_V << SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA_S)
#define SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA_S  12
/** SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA    (BIT(13))
#define SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA_M  (SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA_V << SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA_S)
#define SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA_S  13
/** SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA : R/W; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA    (BIT(14))
#define SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA_M  (SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA_V << SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA_S)
#define SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA_S  14
/** SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA    (BIT(15))
#define SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA_M  (SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA_V << SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA_S)
#define SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA_S  15
/** SLCHOST_FN1_SLC0_RX_UDF_INT_ENA : R/W; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_RX_UDF_INT_ENA    (BIT(16))
#define SLCHOST_FN1_SLC0_RX_UDF_INT_ENA_M  (SLCHOST_FN1_SLC0_RX_UDF_INT_ENA_V << SLCHOST_FN1_SLC0_RX_UDF_INT_ENA_S)
#define SLCHOST_FN1_SLC0_RX_UDF_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_RX_UDF_INT_ENA_S  16
/** SLCHOST_FN1_SLC0_TX_OVF_INT_ENA : R/W; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_TX_OVF_INT_ENA    (BIT(17))
#define SLCHOST_FN1_SLC0_TX_OVF_INT_ENA_M  (SLCHOST_FN1_SLC0_TX_OVF_INT_ENA_V << SLCHOST_FN1_SLC0_TX_OVF_INT_ENA_S)
#define SLCHOST_FN1_SLC0_TX_OVF_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_TX_OVF_INT_ENA_S  17
/** SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA : R/W; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA    (BIT(18))
#define SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA_M  (SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA_V << SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA_S)
#define SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA_S  18
/** SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA : R/W; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA    (BIT(19))
#define SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA_M  (SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA_V << SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA_S)
#define SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA_S  19
/** SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA : R/W; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA    (BIT(20))
#define SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA_M  (SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA_V << SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA_S)
#define SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA_S  20
/** SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA : R/W; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA    (BIT(21))
#define SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA_M  (SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA_V << SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA_S)
#define SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA_S  21
/** SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA : R/W; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA    (BIT(22))
#define SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA_M  (SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA_V << SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA_S)
#define SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA_S  22
/** SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA : R/W; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA    (BIT(23))
#define SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA_M  (SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA_V << SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA_S)
#define SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA_S  23
/** SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA : R/W; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA    (BIT(24))
#define SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA_M  (SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA_V << SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA_S)
#define SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA_S  24
/** SLCHOST_FN1_GPIO_SDIO_INT_ENA : R/W; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FN1_GPIO_SDIO_INT_ENA    (BIT(25))
#define SLCHOST_FN1_GPIO_SDIO_INT_ENA_M  (SLCHOST_FN1_GPIO_SDIO_INT_ENA_V << SLCHOST_FN1_GPIO_SDIO_INT_ENA_S)
#define SLCHOST_FN1_GPIO_SDIO_INT_ENA_V  0x00000001U
#define SLCHOST_FN1_GPIO_SDIO_INT_ENA_S  25

